In [1]:
import duckdb 
import pandas as pd

In [2]:
%load_ext sql

In [3]:
conn = duckdb.connect()

In [4]:
%sql conn --alias duckdb

In [5]:
data = [["ğŸğŸ", "NY", 10],
        ["ğŸŠğŸŠ", "CA", 15],
        ["ğŸğŸ", "CA", 20],
        ["ğŸğŸ", "NY", 18]]

data = pd.DataFrame(data, columns=["Fruit", "Store", "Amount"])
data

  Fruit Store  Amount
0    ğŸğŸ    NY      10
1    ğŸŠğŸŠ    CA      15
2    ğŸğŸ    CA      20
3    ğŸğŸ    NY      18

In [6]:
query = """ 
SELECT Fruit, Store, Sum(Amount)
FROM data 
GROUP BY GROUPING SETS (
(Fruit), (Store)
);
"""

duckdb.sql(query).df()

  Fruit Store  sum(Amount)
0    ğŸŠğŸŠ  None         15.0
1    ğŸğŸ  None         18.0
2  None    NY         28.0
3    ğŸğŸ  None         30.0
4  None    CA         35.0

In [8]:
query = """
SELECT Fruit, Store, Sum(Amount)
FROM data 
GROUP BY ROLLUP (
Fruit, Store);
"""

duckdb.sql(query).df()

  Fruit Store  sum(Amount)
0    ğŸğŸ  None         18.0
1  None  None         63.0
2    ğŸğŸ    CA         20.0
3    ğŸŠğŸŠ  None         15.0
4    ğŸŠğŸŠ    CA         15.0
5    ğŸğŸ    NY         10.0
6    ğŸğŸ    NY         18.0
7    ğŸğŸ  None         30.0

In [9]:
query = """
SELECT Fruit, Store, Sum(Amount)
FROM data 
GROUP BY CUBE (
Fruit, Store)
"""

duckdb.sql(query).df()

  Fruit Store  sum(Amount)
0    ğŸŠğŸŠ  None         15.0
1    ğŸğŸ    NY         10.0
2    ğŸğŸ    NY         18.0
3  None    NY         28.0
4    ğŸğŸ  None         18.0
5    ğŸŠğŸŠ    CA         15.0
6  None  None         63.0
7    ğŸğŸ  None         30.0
8    ğŸğŸ    CA         20.0
9  None    CA         35.0